tests/benchmark/results/wrk2/wrk_pool_c1000.log
Running 10s test @ http://127.0.0.1:11312/hello
  2 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.46s     1.75s    6.42s    58.55%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.15s 
 75.000%    3.80s 
 90.000%    5.17s 
 99.000%    6.14s 
 99.900%    6.34s 
 99.990%    6.40s 
 99.999%    6.42s 
100.000%    6.42s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.157     0.000000            1         1.00
     401.663     0.100000        10005         1.11
     670.207     0.200000        20017         1.25
    1081.343     0.300000        30003         1.43
    1660.927     0.400000        40016         1.67
    2150.399     0.500000        50036         2.00
    2414.591     0.550000        55031         2.22
    2723.839     0.600000        60016         2.50
    3043.327     0.650000        65008         2.86
    3403.775     0.700000        70028         3.33
    3796.991     0.750000        75019         4.00
    4016.127     0.775000        77516         4.44
    4255.743     0.800000        80013         5.00
    4476.927     0.825000        82524         5.71
    4694.015     0.850000        85022         6.67
    4931.583     0.875000        87534         8.00
    5050.367     0.887500        88770         8.89
    5169.151     0.900000        90008        10.00
    5292.031     0.912500        91276        11.43
    5414.911     0.925000        92515        13.33
    5545.983     0.937500        93755        16.00
    5615.615     0.943750        94393        17.78
    5685.247     0.950000        95020        20.00
    5754.879     0.956250        95628        22.86
    5824.511     0.962500        96266        26.67
    5894.143     0.968750        96906        32.00
    5926.911     0.971875        97204        35.56
    5959.679     0.975000        97510        40.00
    5996.543     0.978125        97847        45.71
    6029.311     0.981250        98151        53.33
    6066.175     0.984375        98466        64.00
    6082.559     0.985938        98602        71.11
    6103.039     0.987500        98765        80.00
    6123.519     0.989062        98917        91.43
    6148.095     0.990625        99085       106.67
    6172.671     0.992188        99242       128.00
    6184.959     0.992969        99314       142.22
    6197.247     0.993750        99385       160.00
    6213.631     0.994531        99471       182.86
    6230.015     0.995313        99547       213.33
    6246.399     0.996094        99619       256.00
    6254.591     0.996484        99653       284.44
    6266.879     0.996875        99697       320.00
    6279.167     0.997266        99740       365.71
    6287.359     0.997656        99767       426.67
    6299.647     0.998047        99806       512.00
    6307.839     0.998242        99831       568.89
    6316.031     0.998437        99848       640.00
    6324.223     0.998633        99865       731.43
    6332.415     0.998828        99885       853.33
    6340.607     0.999023        99903      1024.00
    6348.799     0.999121        99919      1137.78
    6352.895     0.999219        99926      1280.00
    6356.991     0.999316        99933      1462.86
    6365.183     0.999414        99946      1706.67
    6369.279     0.999512        99952      2048.00
    6373.375     0.999561        99958      2275.56
    6377.471     0.999609        99964      2560.00
    6381.567     0.999658        99970      2925.71
    6385.663     0.999707        99976      3413.33
    6385.663     0.999756        99976      4096.00
    6389.759     0.999780        99981      4551.11
    6389.759     0.999805        99981      5120.00
    6393.855     0.999829        99986      5851.43
    6393.855     0.999854        99986      6826.67
    6397.951     0.999878        99990      8192.00
    6397.951     0.999890        99990      9102.22
    6402.047     0.999902        99993     10240.00
    6402.047     0.999915        99993     11702.86
    6402.047     0.999927        99993     13653.33
    6406.143     0.999939        99996     16384.00
    6406.143     0.999945        99996     18204.44
    6406.143     0.999951        99996     20480.00
    6406.143     0.999957        99996     23405.71
    6410.239     0.999963        99997     27306.67
    6410.239     0.999969        99997     32768.00
    6414.335     0.999973        99998     36408.89
    6414.335     0.999976        99998     40960.00
    6414.335     0.999979        99998     46811.43
    6418.431     0.999982        99999     54613.33
    6418.431     0.999985        99999     65536.00
    6418.431     0.999986        99999     72817.78
    6418.431     0.999988        99999     81920.00
    6418.431     0.999989        99999     93622.86
    6422.527     0.999991       100000    109226.67
    6422.527     1.000000       100000          inf
#[Mean    =     2457.419, StdDeviation   =     1753.927]
#[Max     =     6418.432, Total count    =       100000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  100000 requests in 10.50s, 9.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 3295
Requests/sec:   9522.59
Transfer/sec:      0.92MB