tests/benchmark/results/wrk2/wrk_pool_c800.log
Running 10s test @ http://127.0.0.1:9655/hello
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76s     1.19s    4.34s    58.30%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.60s 
 75.000%    2.71s 
 90.000%    3.56s 
 99.000%    4.16s 
 99.900%    4.30s 
 99.990%    4.34s 
 99.999%    4.34s 
100.000%    4.34s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.207     0.000000            1         1.00
     346.367     0.100000         8006         1.11
     551.935     0.200000        16007         1.25
     821.247     0.300000        24009         1.43
    1189.887     0.400000        32006         1.67
    1602.559     0.500000        40005         2.00
    1797.119     0.550000        44003         2.22
    1992.703     0.600000        48007         2.50
    2234.367     0.650000        52007         2.86
    2473.983     0.700000        56024         3.33
    2713.599     0.750000        60017         4.00
    2848.767     0.775000        62023         4.44
    2990.079     0.800000        64014         5.00
    3129.343     0.825000        66018         5.71
    3264.511     0.850000        68000         6.67
    3403.775     0.875000        70003         8.00
    3479.551     0.887500        71019         8.89
    3555.327     0.900000        72012        10.00
    3635.199     0.912500        73027        11.43
    3710.975     0.925000        74000        13.33
    3786.751     0.937500        75000        16.00
    3827.711     0.943750        75508        17.78
    3866.623     0.950000        76012        20.00
    3907.583     0.956250        76516        22.86
    3946.495     0.962500        77005        26.67
    3987.455     0.968750        77511        32.00
    4007.935     0.971875        77764        35.56
    4028.415     0.975000        78003        40.00
    4050.943     0.978125        78269        45.71
    4073.471     0.981250        78509        53.33
    4100.095     0.984375        78763        64.00
    4112.383     0.985938        78879        71.11
    4126.719     0.987500        79010        80.00
    4143.103     0.989062        79125        91.43
    4161.535     0.990625        79258       106.67
    4179.967     0.992188        79383       128.00
    4188.159     0.992969        79442       142.22
    4198.399     0.993750        79508       160.00
    4210.687     0.994531        79574       182.86
    4222.975     0.995313        79634       213.33
    4235.263     0.996094        79689       256.00
    4243.455     0.996484        79725       284.44
    4251.647     0.996875        79763       320.00
    4259.839     0.997266        79800       365.71
    4263.935     0.997656        79819       426.67
    4272.127     0.998047        79854       512.00
    4276.223     0.998242        79869       568.89
    4280.319     0.998437        79883       640.00
    4284.415     0.998633        79893       731.43
    4292.607     0.998828        79911       853.33
    4300.799     0.999023        79928      1024.00
    4304.895     0.999121        79936      1137.78
    4308.991     0.999219        79943      1280.00
    4313.087     0.999316        79950      1462.86
    4317.183     0.999414        79960      1706.67
    4321.279     0.999512        79968      2048.00
    4321.279     0.999561        79968      2275.56
    4325.375     0.999609        79974      2560.00
    4325.375     0.999658        79974      2925.71
    4329.471     0.999707        79981      3413.33
    4329.471     0.999756        79981      4096.00
    4333.567     0.999780        79989      4551.11
    4333.567     0.999805        79989      5120.00
    4333.567     0.999829        79989      5851.43
    4333.567     0.999854        79989      6826.67
    4337.663     0.999878        79995      8192.00
    4337.663     0.999890        79995      9102.22
    4337.663     0.999902        79995     10240.00
    4337.663     0.999915        79995     11702.86
    4337.663     0.999927        79995     13653.33
    4341.759     0.999939        80000     16384.00
    4341.759     1.000000        80000          inf
#[Mean    =     1761.445, StdDeviation   =     1187.113]
#[Max     =     4337.664, Total count    =        80000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  80000 requests in 10.00s, 7.71MB read
  Socket errors: connect 0, read 0, write 0, timeout 2610
Requests/sec:   7999.21
Transfer/sec:    788.98KB